gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    // Return an error if there was no specified file
    if (bpacketCharArray->string[0] == '\0') {

        sprintf(j, "bpacket array was empty: [%s]\r\n", bpacketCharArray->string);
        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
        esp32_uart_send_bpacket(&b1);

        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR,
                          "No file was specified\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    // Max file length is 50
    uint16_t filePathNameSize = chars_get_num_bytes(bpacketCharArray->string);

    if (filePathNameSize > (57)) { // including mount point which is current 7 bytes

        sprintf(j, "file name size > 57 [%s] = %i\r\n", bpacketCharArray->string,
                chars_get_num_bytes(bpacketCharArray->string));
        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
        esp32_uart_send_bpacket(&b1);

        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR, "File path > 50\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    sprintf(j, "Creating file path\r\n");
    bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
    esp32_uart_send_bpacket(&b1);

    char filePath[filePathNameSize + 1]; // add one for null pointer!
    sprintf(filePath, "%s/", MOUNT_POINT_PATH);
    int i = 0;
    for (i = 0; i < filePathNameSize; i++) {
        filePath[i + 8] = bpacketCharArray->string[i];
    }
    filePath[i + 8] = '\0'; // Add null terminator

    sprintf(j, "File path made: [%s]\r\n", filePath);
    bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
    esp32_uart_send_bpacket(&b1);
    // char* filePath = bpacketCharArray->string;

    // char fullPath[MAX_PATH_LENGTH];
    // sprintf(fullPath, "%s/%s", MOUNT_POINT_PATH, filePath);
    FILE* file = fopen(filePath, "rb"); // read binary file

    if (file == NULL) {

        sprintf(j, "Couldn't open file [%s]\r\n", filePath);
        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
        esp32_uart_send_bpacket(&b1);

        char msg[100];
        sprintf(msg, "File was NULL: [%i] [%s] => [%s]\r\n", filePathNameSize, filePath, strerror(errno));
        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR, msg);
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    // Get the size of the file in bytes
    fseek(file, 0L, SEEK_END);
    uint32_t fileNumBytes = ftell(file);
    fseek(file, 0L, SEEK_SET);

    sprintf(j, "Image size: %i bytes\r\n", fileNumBytes);
    bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
    esp32_uart_send_bpacket(&b1);

    // Change the values of the bpacket so they get sent to Maple
    bpacket->sender   = receiver;
    bpacket->receiver = sender;
    bpacket->code     = BPACKET_CODE_IN_PROGRESS;
    bpacket->numBytes = BPACKET_MAX_NUM_DATA_BYTES;
    int pi            = 0;

    char info[50];
    bpacket_get_info(bpacket, info);
    sprintf(j, "Image size: %i bytes\r\n", fileNumBytes);
    bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
    esp32_uart_send_bpacket(&b1);

    for (uint32_t i = 0; i < fileNumBytes; i++) {

        bpacket->bytes[pi++] = fgetc(file);

        if (pi < BPACKET_MAX_NUM_DATA_BYTES && (i + 1) != fileNumBytes) {
            continue;
        }

        if ((i + 1) == fileNumBytes) {
            bpacket->code     = BPACKET_CODE_SUCCESS;
            bpacket->numBytes = pi--;
        }

        esp32_uart_send_bpacket(bpacket);

        pi = 0;
    }

    sprintf(j, "Image fully sent. Closeing file\r\n");
    bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
    esp32_uart_send_bpacket(&b1);

    fclose(file);

    // Close the SD card
    sd_card_close();
}

uint8_t sd_card_write_watchdog_settings(bpacket_t* bpacket) {

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                          "SD card failed to open\0");
        return FALSE;
    }

    // Confirm file path exists. Create it if it does not
    FILE* file = fopen(SETTINGS_FILE_PATH_START_AT_ROOT, "wb"); // write binary file
    if (file == NULL) {
        char msg[70];
        sprintf(msg, "Failed to open '%s' for writing. Error: %s", SETTINGS_FILE_PATH_START_AT_ROOT, strerror(errno));
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR, msg);
        return FALSE;
    }

    // Rewrite bytes file in the same order as the bpacket for simplicity
    for (int i = 0; i < bpacket->numBytes; i++) {
        fputc(bpacket->bytes[i], file);
    }

    // Clean up
    fclose(file);
    sd_card_close();

    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Update bapacket to send as success response back
    bpacket->numBytes = 0;
    bpacket->receiver = sender;
    bpacket->sender   = receiver;
    bpacket->code     = BPACKET_CODE_SUCCESS;

    return TRUE;
}

uint8_t sd_card_read_watchdog_settings(bpacket_t* bpacket) {

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                          "SD card failed to open\0");
        return FALSE;
    }

    FILE* file = fopen(SETTINGS_FILE_PATH_START_AT_ROOT, "rb"); // read binary file
    if (file == NULL) {
        char msg[70];
        sprintf(msg, "Failed to open '%s'. Error: %s", SETTINGS_FILE_PATH_START_AT_ROOT, strerror(errno));
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR, msg);
        return FALSE;
    }

    // Calculate the length of the file
    fseek(file, 0L, SEEK_END);
    bpacket->numBytes = ftell(file);
    fseek(file, 0L, SEEK_SET);

    // If the file is empty, return error
    if (bpacket->numBytes == 0) {
        char msg[70];
        sprintf(msg, "File '%s' was empty.", SETTINGS_FILE_PATH_START_AT_ROOT);
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR, msg);
        fclose(file);
        return FALSE;
    }

